In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgresql:///opportunity_youth")

In [3]:
 df_oy = pd.read_sql(sql="SELECT * FROM table_final_query_0", con=engine)

In [8]:
df_oy

                     pop age_group      est    total  pct
0                 oy_yes     16-18  1,815.0 30,141.0  6.0
1                  oy_no     16-18 23,949.0 30,141.0 79.5
2  working w/o a diploma     16-18  4,377.0 30,141.0 14.5
3                 oy_yes     19-21  3,902.0 25,486.0 15.3
4                  oy_no     19-21 19,954.0 25,486.0 78.3
5  working w/o a diploma     19-21  1,630.0 25,486.0  6.4
6                  oy_no     22-24 23,707.0 30,256.0 78.4
7  working w/o a diploma     22-24  1,652.0 30,256.0  5.5
8                 oy_yes     22-24  4,897.0 30,256.0 16.2

In [5]:
df_oy_new = df_oy.pivot(index='pop', columns='age_group', values=['est','total','pct'])
pd.options.display.float_format = '{:,.1f}'.format
df_oy_new

                           est                      total                    \
age_group                16-18    19-21    22-24    16-18    19-21    22-24
pop
oy_no                 23,949.0 19,954.0 23,707.0 30,141.0 25,486.0 30,256.0
oy_yes                 1,815.0  3,902.0  4,897.0 30,141.0 25,486.0 30,256.0
working w/o a diploma  4,377.0  1,630.0  1,652.0 30,141.0 25,486.0 30,256.0

                        pct
age_group             16-18 19-21 22-24
pop
oy_no                  79.5  78.3  78.4
oy_yes                  6.0  15.3  16.2
working w/o a diploma  14.5   6.4   5.5

In [6]:
!pwd

/Users/karenwarmbein/ds/lectures/opportunity_youth

In [ ]:
df_oy_new['Totals'] = df_oy_new.sum(axis=1)
df_oy_new.to_csv("data/processed/OY_Status_by_Age.csv", index=True)

In [7]:
df_oy_new.to_excel("data/processed/OY_Status_by_Age.xlsx")

In [9]:
df_oy_new.rename(index={'oy_no':'Not an Opportunity Youth', 'oy_yes':'Opportunity Youth','working w/o a diploma':'Working without a diploma'})

                               est                      total           \
age_group                    16-18    19-21    22-24    16-18    19-21
pop
Not an Opportunity Youth  23,949.0 19,954.0 23,707.0 30,141.0 25,486.0
Opportunity Youth          1,815.0  3,902.0  4,897.0 30,141.0 25,486.0
Working without a diploma  4,377.0  1,630.0  1,652.0 30,141.0 25,486.0

                                     pct
age_group                    22-24 16-18 19-21 22-24
pop
Not an Opportunity Youth  30,256.0  79.5  78.3  78.4
Opportunity Youth         30,256.0   6.0  15.3  16.2
Working without a diploma 30,256.0  14.5   6.4   5.5

In [ ]:
df_oy_new['Total Population'] = df_oy_new.sum()
df_oy_new['Total Population']

In [ ]:
df_oy_new

In [ ]:
df_oy

In [ ]:

pd.wide_to_long(df_oy, stubnames=['est','total','pct'], i='pop', j='age_group').reset_index(drop=True)